# Исследование надежности заемщиков.

### Шаг 1. Обзор данных

Прочитаем датафрейм и посмотрим информацию о нем

In [183]:
import pandas as pd
df = pd.read_csv('/Users/danil/Downloads/data (1).csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [184]:
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья
1,1,-4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля
2,0,-5623.422610,33,Среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья
3,3,-4124.747207,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование
4,0,340266.072047,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу

Сразу видим ошибки в столбце 'days_employed' – минусовые значения

Посмотрим все категориальные значениея. Начнем со столбца 'children'

In [185]:
df['children'].value_counts()

 0     14149
 1      4818
 2      2055
 3       330
 20       76
-1        47
 4        41
 5         9
Name: children, dtype: int64

Видим, что есть ошибки:

1. Минусовое колличество детей.
2. 20 детей.

Далее идет 'dob_years'

In [186]:
df['dob_years'].value_counts().sort_index()

0     101
19     14
20     51
21    111
22    183
23    254
24    264
25    357
26    408
27    493
28    503
29    545
30    540
31    560
32    510
33    581
34    603
35    617
36    555
37    537
38    598
39    573
40    609
41    607
42    597
43    513
44    547
45    497
46    475
47    480
48    538
49    508
50    514
51    448
52    484
53    459
54    479
55    443
56    487
57    460
58    461
59    444
60    377
61    355
62    352
63    269
64    265
65    194
66    183
67    167
68     99
69     85
70     65
71     58
72     33
73      8
74      6
75      1
Name: dob_years, dtype: int64

Ошибка: есть возраст '0' лет. Жизнь в России тьяжелая, но не настолько, чтобы с рождения брать кредиты.

Смотрим столбец 'education'

In [187]:
df['education'].sort_values().value_counts()

среднее                13750
высшее                  4718
СРЕДНЕЕ                  772
Среднее                  711
неоконченное высшее      668
ВЫСШЕЕ                   274
Высшее                   268
начальное                250
Неоконченное высшее       47
НЕОКОНЧЕННОЕ ВЫСШЕЕ       29
НАЧАЛЬНОЕ                 17
Начальное                 15
ученая степень             4
УЧЕНАЯ СТЕПЕНЬ             1
Ученая степень             1
Name: education, dtype: int64

Видим, что есть дубли которые нужно удалить

Смотрим столбец 'education_id'

In [188]:
df['education_id'].value_counts()

1    15233
0     5260
2      744
3      282
4        6
Name: education_id, dtype: int64

Тут все содится. В нашей таблице есть 5 уровней образования. Так же реалестично выглядит картина того, что большинство заевщиков имеет среднее образование. И чем выше уровень образования, тем меньше людей берущих кредит.

Смотрим столбец 'family_status'

In [189]:
df['family_status'].value_counts()

женат / замужем          12380
гражданский брак          4177
Не женат / не замужем     2813
в разводе                 1195
вдовец / вдова             960
Name: family_status, dtype: int64

Большинство людей берущих кредит находятся в браке

In [190]:
df['family_status_id'].value_counts()

0    12380
1     4177
4     2813
3     1195
2      960
Name: family_status_id, dtype: int64

Семейный статус id соответствует категориям

Смотрим 'gender'

In [191]:
df['gender'].value_counts()

F      14236
M       7288
XNA        1
Name: gender, dtype: int64

Есть всего один неопределенный пол

Смотрим 'income_type'

In [192]:
df['income_type'].value_counts()

сотрудник          11119
компаньон           5085
пенсионер           3856
госслужащий         1459
безработный            2
предприниматель        2
студент                1
в декрете              1
Name: income_type, dtype: int64

Смотрим сколько заемщиков имели задолжность

In [194]:
df['debt'].value_counts()

0    19784
1     1741
Name: debt, dtype: int64

Смотрим цели займов

In [195]:
df['purpose'].value_counts().sort_index()

автомобили                                478
автомобиль                                495
высшее образование                        453
дополнительное образование                462
жилье                                     647
заняться высшим образованием              496
заняться образованием                     412
на покупку автомобиля                     472
на покупку подержанного автомобиля        479
на покупку своего автомобиля              505
на проведение свадьбы                     777
недвижимость                              634
образование                               447
операции с жильем                         653
операции с коммерческой недвижимостью     651
операции с недвижимостью                  676
операции со своей недвижимостью           630
покупка жилой недвижимости                607
покупка жилья                             647
покупка жилья для сдачи                   653
покупка жилья для семьи                   641
покупка коммерческой недвижимости         664
покупка недвижимости                      624
покупка своего жилья                      620
получение высшего образования             426
получение дополнительного образования     447
получение образования                     443
приобретение автомобиля                   462
профильное образование                    436
ремонт жилью                              612
свадьба                                   797
свой автомобиль                           480
сделка с автомобилем                      455
сделка с подержанным автомобилем          489
строительство жилой недвижимости          626
строительство недвижимости                620
строительство собственной недвижимости    635
сыграть свадьбу                           774
Name: purpose, dtype: int64

Есть много дублей которые нужно удалить

### Шаг 2.1 Заполнение пропусков

Находим столбцы с пропусками

In [196]:
df.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

Пропущены значения в столбцах: 'days_employed' и 'total_income'

Возможные причины появления пропусков в данных: 

1. Пропуски в total_income скорее всего связаны с технической ошибкой при обработке данных, так как зарабатная плата один из обязательных пунктов при подаче заявки на кредитование. 

2. Пропуски в days_employed можно объяснить невозможностью отслеживать банком колличества отработанных дней заемщиком.

In [197]:
days_employed_ = 2174 / df['days_employed'].count() * 100
print(f'Доля пропущенных значения в столбцах days_employed и total_income составляет {round(days_employed_, 2)}%')

Доля пропущенных значения в столбцах days_employed и total_income составляет 11.23%

Возможные причины появления пропусков в данных:

1. Пропуски в total_income скорее всего связаны с технической ошибкой при обработке данных, так как зарабатная плата один из обязательных пунктов при подаче заявки на кредитование.
2. Пропуски в days_employed можно объяснить невозможностью отслеживать банком колличества отработанных дней заемщиком.

Заполнить проуски в столбце total_income медианным значением – лучшее решение, поскольку оно показывает заработную плату большинства заемщиков и поэтому ближе всего к реальной з/п людей с проущенным значением

In [198]:
total_income_median = df['total_income'].median()
df['total_income'] = df['total_income'].fillna(total_income_median)

### Шаг 2.2 Проверка данных на аномалии и исправления.

Удаляем минусы из столбцов 'days_employed' и 'children'

Считаем медиану для 'days_employed' и заполняем ей пустые значения

In [199]:
df['days_employed'] = df['days_employed'].abs()
days_employed_median = df['days_employed'].median()
df['days_employed'] = df['days_employed'].fillna(days_employed_median)

In [200]:
df['children'] = df['children'].abs()

### Шаг 2.3. Изменение типов данных.

Меняем тип данных в столбце 'total_income' на целочисленный

In [201]:
df['total_income'] = df['total_income'].astype('int64')

### Шаг 2.4. Удаление дубликатов.

In [202]:
# Приводим данные в столбцах к нижнему регистру

df['education'] = df['education'].str.lower()
df['family_status'] = df['family_status'].str.lower()
df['income_type'] = df['income_type'].str.lower()
df['purpose'] = df['purpose'].str.lower()

In [203]:
# Удаляем дубликаты

df = df.drop_duplicates().reset_index(drop=True)

Для удаления дубликатов, сначала все категориальные стоблцы (за исключением 'gender') были приведены к нижнему регистру, затем удалены дубликаты.

Возможные причины появления дубликатов – заполнение данных разными людьми, в связи с чем были слова писались и с большой и смаленькой заглавной буквы.

### Шаг 2.5. Формирование дополнительных датафреймов словарей, декомпозиция исходного датафрейма.

In [204]:
# Создайте два новых датафрейма, в которых:
# каждому уникальному значению из education соответствует уникальное значение education_id — в первом;
# каждому уникальному значению из family_status соответствует уникальное значение family_status_id — во втором.
# Удаляем из исходного датафрейма столбцы education и family_status, оставив только их идентификаторы: education_id и family_status_id.

df_education = df[['education', 'education_id']]
df_family_status = df[['family_status', 'family_status_id']]
# df.drop(columns=['education', 'family_status'], inplace=True)

In [205]:
df_education

      education  education_id
0        высшее             0
1       среднее             1
2       среднее             1
3       среднее             1
4       среднее             1
...         ...           ...
21449   среднее             1
21450   среднее             1
21451   среднее             1
21452   среднее             1
21453   среднее             1

[21454 rows x 2 columns]

In [206]:
df_family_status

          family_status  family_status_id
0       женат / замужем                 0
1       женат / замужем                 0
2       женат / замужем                 0
3       женат / замужем                 0
4      гражданский брак                 1
...                 ...               ...
21449  гражданский брак                 1
21450   женат / замужем                 0
21451  гражданский брак                 1
21452   женат / замужем                 0
21453   женат / замужем                 0

[21454 rows x 2 columns]

### Шаг 2.6. Категоризация дохода.

In [207]:
# На основании диапазонов, указанных ниже, создайте столбец total_income_category с категориями:
# 0–30000 — 'E';
# 30001–50000 — 'D';
# 50001–200000 — 'C';
# 200001–1000000 — 'B';
# 1000001 и выше — 'A'

def income(row):
    if row <= 30000:
        return 'E'
    elif row <= 50000:
        return 'D'
    elif row <= 200000:
        return 'C'
    elif row <= 1000000:
        return 'B'
    else:
        return 'A'

In [208]:
# Применяем функцию

df['total_income_category'] = df['total_income'].apply(income)

### Шаг 2.7. Категоризация целей кредита.

In [209]:
auto = ['автомобили', 'автомобиль', 'на покупку автомобиля', 'на покупку подержанного автомобиля','на покупку своего автомобиля', 'приобретение автомобиля', 'свой автомобиль', 'сделка с автомобилем', 'сделка с подержанным автомобилем']
real_estate = ['жилье', 'недвижимость', 'операции с жильем', 'операции с коммерческой недвижимостью','операции с недвижимостью', 'операции со своей недвижимостью', 'покупка жилой недвижимости', 'покупка жилья','покупка жилья для сдачи', 'покупка жилья для семьи','покупка коммерческой недвижимости', 'покупка недвижимости','покупка своего жилья', 'строительство жилой недвижимости', 'строительство недвижимости','строительство собственной недвижимости', 'ремонт жилью']
wedding = ['на проведение свадьбы', 'свадьба', 'сыграть свадьбу']
education = ['высшее образование', 'дополнительное образование', 'заняться высшим образованием', 'заняться образованием', 'образование', 'получение высшего образования', 'получение дополнительного образования', 'получение образования', 'профильное образование']

def income(row):
    try:
        if row in auto:
            return 'операции с автомобилем'
        elif row in real_estate:
            return 'операции с недвижимостью'
        elif row in wedding:
            return 'проведение свадьбы'
        elif row in education:
            return 'получение образования'
    except:
        print('Ошибка. Не подходит ни под одну категорию')

In [210]:
df['purpose_category'] = df['purpose'].apply(income)

In [212]:
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,total_income_category,purpose_category
0,1,8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875,покупка жилья,B,операции с недвижимостью
1,1,4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080,приобретение автомобиля,C,операции с автомобилем
2,0,5623.422610,33,среднее,1,женат / замужем,0,M,сотрудник,0,145885,покупка жилья,C,операции с недвижимостью
3,3,4124.747207,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628,дополнительное образование,B,получение образования
4,0,340266.072047,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616,сыграть свадьбу,C,проведение свадьбы

### Ответы на вопросы.

##### Вопрос 1: Есть ли зависимость между количеством детей и возвратом кредита в срок?

In [220]:
children_pivot = pd.pivot_table(df, index='children', values='debt').sort_values(by='debt',ascending=True) 
children_siries = df[['children']].value_counts()
children_merge = children_pivot.merge(children_siries.rename('count'), on='children', how='left')
children_merge

              debt  count
children
5         0.000000      9
0         0.075438  14091
3         0.081818    330
1         0.091658   4855
2         0.094542   2052
4         0.097561     41
20        0.105263     76

##### Вывод 1:

Из таблицы мы видим, что задолжность отсутствует у заемщиков с 5-ю детьми. Однако это не показательно, поскольку в этой категории всего 9 заемщиков.

Куда более показательно, что отсутсвие детей положительно вляет на выплату займа. 

А вот количество детей не так очевидно влияет на результат. Содной стороны заемщики с 3 детьми лучше остальных выплачивают кредиты, но с другой – выборка по ним в разы меньше чем по заемщикам с 1 и 2 детьми.

##### Вопрос 2: Есть ли зависимость между семейным положением и возвратом кредита в срок?

In [216]:
family_status_pivot = pd.pivot_table(df, index='family_status', values='debt').sort_values(by='debt',ascending=True) 
family_status_siries = df[['family_status']].value_counts()
family_status_merge = family_status_pivot.merge(family_status_siries.rename('count'), on='family_status', how='left')
family_status_merge

                           debt  count
family_status
вдовец / вдова         0.065693    959
в разводе              0.071130   1195
женат / замужем        0.075452  12339
гражданский брак       0.093471   4151
не женат / не замужем  0.097509   2810

##### Вывод 2:

Из таблицы видно, что люди которые никогда небыли в браке – хуже всего отдают кредиты.

Однако разведенные люди или вдовы/вдовцы выплачивают займы лучше чем те, которые находятся в браке.

Предпологаю, что брак помогает быть более ответственным.

##### Вопрос 3: Есть ли зависимость между уровнем дохода и возвратом кредита в срок?

In [218]:
total_income_category_pivot = pd.pivot_table(df, index='total_income_category', values='debt').sort_values(by='debt',ascending=True) 
total_income_category_siries = df[['total_income_category']].value_counts()
total_income_category_merge = total_income_category_pivot.merge(total_income_category_siries.rename('count'), on='total_income_category', how='left')
total_income_category_merge

                           debt  count
total_income_category
D                      0.060000    350
B                      0.070621   5041
A                      0.080000     25
C                      0.084915  16016
E                      0.090909     22

##### Вывод 3:

Минимальная задолжность у людей со средним доходом. Максимальная задолжность – у людей с минимальным доходом.

Интересно, что реже всех берут кредиты люди с максимальным и с минимальным доходом. Первым он скорее всего не нужен, а вторым его не дают. 

Чаще всего кредиты берут люди со средним достатком.

##### Вопрос 4: Как разные цели кредита влияют на его возврат в срок?

In [219]:
purpose_category_pivot = pd.pivot_table(df, index='purpose_category', values='debt').sort_values(by='debt',ascending=True) 
purpose_category_siries = df[['purpose_category']].value_counts()
purpose_category_merge = purpose_category_pivot.merge(purpose_category_siries.rename('count'), on='purpose_category', how='left')
purpose_category_merge

                              debt  count
purpose_category
операции с недвижимостью  0.072334  10811
проведение свадьбы        0.080034   2324
получение образования     0.092200   4013
операции с автомобилем    0.093590   4306

##### Вывод 4:

Лучше всего возвращают кредиты взятые на операции с недвижимостью.

Хуже всего возвращают кредиты взятые на операции с автомобилем.

## Общий вывод:

Лучше всего выплачивают кердиты люди без детей, бывшие до этого в браке, с доходом от 30000 до 50000 и всзявшие его на операции с недвижимостью.

Хуже всех выплачвают кердиты люди с 4 и более детьми, с доходом до 30000 и всзявшие его на операции с автомобилем.